app/views/venues/show.html.erb

SELECT  "users".* FROM "users" INNER JOIN "goings" ON "users"."id" = "goings"."user_id" WHERE "goings"."venue_id" = $1 AND "users"."id" = $2 LIMIT 1  [["venue_id", 1], ["id", 1]]
SELECT  "goings".* FROM "goings" WHERE "goings"."user_id" = $1 AND "goings"."venue_id" = $2 LIMIT 1  [["user_id", 1], ["venue_id", 4]]
---

<% is_going = @venue.users.find_by(id: current_user.id) %>

<% if @venue.users.find_by(id: current_user.id) == nil || Going.where(venue_id: @venue, user_id: current_user.id)[0].going == false %>