app/controllers/going_controller.rb

  def create
    @going = Going.new(going_params)
    if @going.save
---
INSERT INTO "goings" ("user_id", "venue_id", "going", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["venue_id", 1], ["going", "t"], ["created_at", "2015-06-10 00:01:52.863326"], ["updated_at", "2015-06-10 00:01:52.863326"]]

  def update
    @venue = Venue.find(params[:venue_id])
    @going_up = Going.where(venue_id: @venue, user_id: current_user.id)[0]
    if @going_up.update_attributes(going_params)
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "goings".* FROM "goings" WHERE "goings"."user_id" = $1 AND "goings"."venue_id" IS NULL  [["user_id", 1]]
UPDATE "goings" SET "going" = $1, "updated_at" = $2 WHERE "goings"."id" = $3  [["going", "f"], ["updated_at", "2015-06-10 01:36:58.306096"], ["id", 4]]