app/controllers/messages_controller.rb

  def new
    @chosen_recipient = User.find_by(id: params[:to].to_i) if params[:to]
    @message_quote = Quote.find(params[:quote_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    recipients = User.where(id: params['recipients'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]