app/controllers/promotors_controller.rb

  def create
    @promotor = Promotor.new(promotor_params)
    if @promotor.save
---
INSERT INTO "promotors" ("user_id", "location", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["location", "miami"], ["email", "kenny@aol.com"], ["created_at", "2015-06-15 18:08:02.007709"], ["updated_at", "2015-06-15 18:08:02.007709"]]