app/controllers/quotes_controller.rb

  def create
    @quote = Quote.new(quote_params)
    if @quote.save
---
INSERT INTO "quotes" ("user_id", "men", "women", "min", "max", "bottles", "venues", "location", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def index
    if current_user.promotor == nil
      redirect_to new_quote_path
    else
      @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"