app/controllers/venues_controller.rb

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "goings".* FROM "goings" WHERE "goings"."user_id" = $1 AND "goings"."venue_id" = $2 LIMIT 1  [["user_id", 1], ["venue_id", 4]]
---
  def show
    @venue = Venue.find(params[:id])
    @going = Going.new()
    @going_up = Going.where(venue_id: @venue, user_id: current_user.id)[0]